app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        // Jika sudah login, redirect ke halaman utama sesuai role
        if (session()->get('isLoggedIn')) {
            return redirect()->to(base_url('/'));
        }

        helper(['form']);
        $data = [];

        if ($this->request->getMethod() === 'post') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // 1. Ambil data pengguna dari database
            $model = new PenggunaModel();
            $user  = $model->findUserByUsername($username);