app/Controllers/Penggajian.php

SELECT *
FROM `komponen_gaji`
SELECT *
FROM `anggota`
---
    public function create()
    {
        $anggotaModel = new AnggotaModel();
        $komponenModel = new KomponenGajiModel();

        return view('penggajian/create', [
            'anggota_list'  => $anggotaModel->findAll(),
            'komponen_list' => $komponenModel->findAll()
        ]);